Stupid-Git/Cyclone-Lin/Cyclone_Open_2_4_4/third_party/nxp/devices/lpc54s018m/drivers/fsl_sdif.c
    uint32_t dmaEntry = 0UL, i, dmaBufferSize = 0UL, dmaBuffer1Size = 0UL;
    uint32_t *tempDMADesBuffer               = config->dmaDesBufferStartAddr;
    const uint32_t *dataBuffer               = data;
    sdif_dma_descriptor_t *descriptorPoniter = NULL;
    uint32_t maxDMABuffer = (uint32_t)FSL_FEATURE_SDIF_INTERNAL_DMA_MAX_BUFFER_SIZE * ((uint32_t)config->mode);

    if ((((uint32_t)data % SDIF_INTERNAL_DMA_ADDR_ALIGN) != 0UL) ||
        (((uint32_t)tempDMADesBuffer % SDIF_INTERNAL_DMA_ADDR_ALIGN) != 0UL))
    {
        return kStatus_SDIF_DMAAddrNotAlign;
    }

    /* check the read/write data size,must be a multiple of 4 */
    if (dataSize % sizeof(uint32_t) != 0UL)
    {
        dataSize += sizeof(uint32_t) - (dataSize % sizeof(uint32_t));
    }

    /*config the bus mode*/
    if (config->enableFixBurstLen)
    {
        base->BMOD |= SDIF_BMOD_FB_MASK;
    }

    /* calculate the dma descriptor entry due to DMA buffer size limit */
    /* if data size smaller than one descriptor buffer size */
    if (dataSize > maxDMABuffer)
    {
        dmaEntry = dataSize / maxDMABuffer + ((dataSize % maxDMABuffer) != 0UL ? 1UL : 0UL);
    }
    else /* need one dma descriptor */
    {
        dmaEntry = 1UL;
    }

    /* check the DMA descriptor buffer len one more time,it is user's responsibility to make sure the DMA descriptor
    table
    size is bigger enough to hold the transfer descriptor */
    if (config->dmaDesBufferLen * sizeof(uint32_t) < (dmaEntry * sizeof(sdif_dma_descriptor_t) + config->dmaDesSkipLen))
    {
        return kStatus_SDIF_DescriptorBufferLenError;
    }

    if (config->mode == kSDIF_DualDMAMode)
    {
        base->BMOD |= SDIF_BMOD_DSL(config->dmaDesSkipLen); /* config the distance between the DMA descriptor */
        for (i = 0UL; i < dmaEntry; i++)
        {
            if (dataSize > (uint32_t)FSL_FEATURE_SDIF_INTERNAL_DMA_MAX_BUFFER_SIZE)
            {
                dmaBufferSize = FSL_FEATURE_SDIF_INTERNAL_DMA_MAX_BUFFER_SIZE;
                dataSize -= dmaBufferSize;
                dmaBuffer1Size = dataSize > (uint32_t)FSL_FEATURE_SDIF_INTERNAL_DMA_MAX_BUFFER_SIZE ?
                                     (uint32_t)FSL_FEATURE_SDIF_INTERNAL_DMA_MAX_BUFFER_SIZE :
                                     dataSize;
                dataSize -= dmaBuffer1Size;
            }
            else
            {
                dmaBufferSize  = dataSize;
                dmaBuffer1Size = 0UL;
            }

            descriptorPoniter = (sdif_dma_descriptor_t *)(uint32_t)tempDMADesBuffer;
            if (i == 0UL)
            {
                descriptorPoniter->dmaDesAttribute = SDIF_DMA_DESCRIPTOR_DATA_BUFFER_START_FLAG |
                                                     SDIF_DMA_DESCRIPTOR_OWN_BY_DMA_FLAG |
                                                     SDIF_DMA_DESCRIPTOR_DISABLE_COMPLETE_INT_FLAG;
            }
            else
            {
                descriptorPoniter->dmaDesAttribute =
                    SDIF_DMA_DESCRIPTOR_OWN_BY_DMA_FLAG | SDIF_DMA_DESCRIPTOR_DISABLE_COMPLETE_INT_FLAG;
            }
            descriptorPoniter->dmaDataBufferSize =
                SDIF_DMA_DESCRIPTOR_BUFFER1_SIZE(dmaBufferSize) | SDIF_DMA_DESCRIPTOR_BUFFER2_SIZE(dmaBuffer1Size);

            descriptorPoniter->dmaDataBufferAddr0 = dataBuffer;
            descriptorPoniter->dmaDataBufferAddr1 = dataBuffer + dmaBufferSize / sizeof(uint32_t);
            dataBuffer += (dmaBufferSize + dmaBuffer1Size) / sizeof(uint32_t);

            /* descriptor skip length */
            tempDMADesBuffer += config->dmaDesSkipLen + sizeof(sdif_dma_descriptor_t) / sizeof(uint32_t);
        }
        /* enable the completion interrupt when reach the last descriptor */
        descriptorPoniter->dmaDesAttribute &= ~SDIF_DMA_DESCRIPTOR_DISABLE_COMPLETE_INT_FLAG;
        descriptorPoniter->dmaDesAttribute |=
            SDIF_DMA_DESCRIPTOR_DATA_BUFFER_END_FLAG | SDIF_DMA_DESCRIPTOR_DESCRIPTOR_END_FLAG;
    }
    else
    {
        for (i = 0UL; i < dmaEntry; i++)
        {
            if (dataSize > (uint32_t)FSL_FEATURE_SDIF_INTERNAL_DMA_MAX_BUFFER_SIZE)
            {
                dmaBufferSize = FSL_FEATURE_SDIF_INTERNAL_DMA_MAX_BUFFER_SIZE;
                dataSize -= (uint32_t)FSL_FEATURE_SDIF_INTERNAL_DMA_MAX_BUFFER_SIZE;
            }
            else
            {
                dmaBufferSize = dataSize;
            }

            descriptorPoniter = (sdif_dma_descriptor_t *)(uint32_t)tempDMADesBuffer;
            if (i == 0UL)
            {
                descriptorPoniter->dmaDesAttribute =
                    SDIF_DMA_DESCRIPTOR_DATA_BUFFER_START_FLAG | SDIF_DMA_DESCRIPTOR_OWN_BY_DMA_FLAG |
                    SDIF_DMA_DESCRIPTOR_SECOND_ADDR_CHAIN_FLAG | SDIF_DMA_DESCRIPTOR_DISABLE_COMPLETE_INT_FLAG;
            }
            else
            {
                descriptorPoniter->dmaDesAttribute = SDIF_DMA_DESCRIPTOR_OWN_BY_DMA_FLAG |
                                                     SDIF_DMA_DESCRIPTOR_SECOND_ADDR_CHAIN_FLAG |
                                                     SDIF_DMA_DESCRIPTOR_DISABLE_COMPLETE_INT_FLAG;
            }
            descriptorPoniter->dmaDataBufferSize =
                SDIF_DMA_DESCRIPTOR_BUFFER1_SIZE(dmaBufferSize); /* use only buffer 1 for data buffer*/
            descriptorPoniter->dmaDataBufferAddr0 = dataBuffer;
            dataBuffer += dmaBufferSize / sizeof(uint32_t);
            tempDMADesBuffer +=
                sizeof(sdif_dma_descriptor_t) / sizeof(uint32_t); /* calculate the next descriptor address */
            /* this descriptor buffer2 pointer to the next descriptor address */
            descriptorPoniter->dmaDataBufferAddr1 = tempDMADesBuffer;
        }
        /* enable the completion interrupt when reach the last descriptor */
        descriptorPoniter->dmaDesAttribute &= ~SDIF_DMA_DESCRIPTOR_DISABLE_COMPLETE_INT_FLAG;
        descriptorPoniter->dmaDesAttribute |= SDIF_DMA_DESCRIPTOR_DATA_BUFFER_END_FLAG;
    }

